[{
	"id": 1,
	"isbn": "9780814414033",
	"title": "Just Listen",
	"subtitle": "Discover the Secret to Getting Through to Absolutely Anyone",
	"description": "Offers listening tools and techniques to make employees, bosses, and clients more willing to agree with proposals.",
	"publisher": "AMACOM Div American Mgmt Assn",
	"publishedDate": "2010",
	"pageCount": 234,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=YbFrqFfBQ0oC\u0026printsec=frontcover\u0026dq=isbn:9780814414033\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=YbFrqFfBQ0oC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api",
	"authors": [{
		"id": 1,
		"name": "Mark Goulston",
		"nationality": null
	}]
}, {
	"id": 2,
	"isbn": "9781517707828",
	"title": "Product Demos That Sell",
	"subtitle": "How to Deliver Winning SaaS Demos",
	"description": "This is the no B.S. guide to presenting software like a pro. If you're a SaaS startup founder or sales rep, you'll learn to: Ensure prospects attend your demos Discover why your demos fail to close the deal Better differentiate yourself from competitors Customize your demo to your prospects' needs Improve your demo-win rates Deal with questions and objections during the demo Expertly handle bugs and demo fails Giving successful product demos is not rocket science. Anybody can do it-if you've got the right blueprint.",
	"publisher": null,
	"publishedDate": "2015-12-24",
	"pageCount": 86,
	"language": "en",
	"google_google_preview_link": "http://books.google.co.uk/books?id=bQE7jwEACAAJ\u0026dq=isbn:9781517707828\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": null,
	"authors": [{
		"id": 2,
		"name": "Steli Efti",
		"nationality": null
	}]
}, {
	"id": 3,
	"isbn": "1590590961",
	"title": "Extreme Programming Refactored",
	"subtitle": "The Case Against XP",
	"description": "Extreme Programming Refactored: The Case Against XP (featuring Songs of the Extremos) takes a satirical look at the increasingly-hyped extreme programming (XP) methodology. It explores some quite astonishing Extremo quotes that have typified the XP approach quotes such as, “XPers are not afraid of oral documentation,” “Schedule is the customer's problem,” “Dependencies between requirements are more a matter of fear than reality” and “Concentration is the enemy.” In between the chuckles, though, there is a serious analysis of XP's many flaws. The authors also examine C3, the first XP project, whose team (most of whom went on to get XP book deals shortly before C3's cancellation) described themselves as \"the best team on the face of the Earth.\" (In a later chapter, the authors also note that one problem which can affect pair programmers is overconfidence—or is that \"eXcessive courage\"?). The authors examine whether the problems that led to C3's “inexplicable” cancellation could also afflict present-day XP projects. In the final chapter, Refactoring XP, Matt and Doug suggest some ways of achieving the agile goals of XP using some XP practices (used in moderation) combined with other, less risk-laden methods.",
	"publisher": "Apress",
	"publishedDate": "2003-08-14",
	"pageCount": 432,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=Y-98v8l0xlIC\u0026printsec=frontcover\u0026dq=isbn:1590590961\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=Y-98v8l0xlIC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api",
	"authors": [{
		"id": 3,
		"name": "Doug Rosenberg",
		"nationality": null
	}, {
		"id": 4,
		"name": "Matt Stephens",
		"nationality": null
	}]
}, {
	"id": 4,
	"isbn": "0321278658",
	"title": "Extreme Programming Explained",
	"subtitle": "Embrace Change",
	"description": "An updated look at the roots, philosophies, stories, and myths associated with Extreme Programming (XP).",
	"publisher": "Pearson Education",
	"publishedDate": "2005",
	"pageCount": 189,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=32RGBAAAQBAJ\u0026dq=isbn:0321278658\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=32RGBAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 5,
		"name": "Kent Beck",
		"nationality": null
	}, {
		"id": 6,
		"name": "Cynthia Andres",
		"nationality": null
	}]
}, {
	"id": 5,
	"isbn": "1492791539",
	"title": "The Non-Technical Guide to Web Technologies",
	"subtitle": null,
	"description": "Do you work in a non-technical role and want to understand and speak technical language? Would you be better at your job if you did? Whether you're in recruiting, marketing, business development, or any other non-technical field, this book will teach you what you need to know to understand the basics and have conversations about the web technologies being used in your business. The book covers enough about web technologies to help your career with 80+ pages of text, diagrams and images.",
	"publisher": "CreateSpace",
	"publishedDate": "2013-11-15",
	"pageCount": 102,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=fm9bngEACAAJ\u0026dq=isbn:1492791539\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=fm9bngEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 7,
		"name": "Tommy Chheng",
		"nationality": null
	}]
}, {
	"id": 6,
	"isbn": "0321205685",
	"title": "User Stories Applied",
	"subtitle": "For Agile Software Development",
	"description": "\"Offers a requirements process that saves time, eliminates rework, and leads directly to better software. A great way to build software that meets users' needs is to begin with 'user stories': simple, clear, brief descriptions of functionality that will be valuable to real users. ... [the author] provides you with a front-to-back blueprint for writing these user stories and weaving them into your development lifecycle. You'll learn what makes a great user story, and what makes a bad one. You'll discover practical ways to gather user stories, even when you can't speak with your users. Then, once you've compiled your user stories, [the author] shows how to organize them, prioritize them, and use them for planning, management, and testing\"--Back cover.",
	"publisher": "Addison-Wesley Professional",
	"publishedDate": "2004",
	"pageCount": 268,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=SvIwuX4SVigC\u0026printsec=frontcover\u0026dq=isbn:0321205685\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=SvIwuX4SVigC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api",
	"authors": [{
		"id": 8,
		"name": "Mike Cohn",
		"nationality": null
	}]
}, {
	"id": 7,
	"isbn": "9780131495050",
	"title": "XUnit Test Patterns",
	"subtitle": "Refactoring Test Code",
	"description": "Improves software return on investment by teaching the reader how to refactor test code and reduce or prevent crippling test maintenance.",
	"publisher": "Addison-Wesley Professional",
	"publishedDate": "2007",
	"pageCount": 883,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=y4JuQgAACAAJ\u0026dq=isbn:9780131495050\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=y4JuQgAACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 9,
		"name": "Gerard Meszaros",
		"nationality": null
	}]
}, {
	"id": 8,
	"isbn": "0596521472",
	"title": "Android Application Development",
	"subtitle": "Programming with the Google SDK",
	"description": "Provides information on using Android to build mobile applications for the Google SDK.",
	"publisher": "\"O'Reilly Media, Inc.\"",
	"publishedDate": "2009-05-13",
	"pageCount": 318,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=DkWbAgAAQBAJ\u0026dq=isbn:0596521472\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=DkWbAgAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 10,
		"name": "Rick Rogers",
		"nationality": null
	}]
}, {
	"id": 9,
	"isbn": "9780321706287",
	"title": "Objective-C Programming",
	"subtitle": "The Big Nerd Ranch Guide",
	"description": "Looks at the basics of Objective-C programming for Apple technologies, covering such topics as Xcode, classes, properties, categories, loops, and ARC.",
	"publisher": "Addison-Wesley",
	"publishedDate": "2011",
	"pageCount": 272,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=Mqu-mnXZAi8C\u0026printsec=frontcover\u0026dq=isbn:9780321706287\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=Mqu-mnXZAi8C\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api",
	"authors": [{
		"id": 11,
		"name": "Aaron Hillegass",
		"nationality": null
	}]
}, {
	"id": 10,
	"isbn": "1118027701",
	"title": "Android Application Development All-in-One For Dummies",
	"subtitle": null,
	"description": "Provides information on Android programming, covering such topics as creating an Android application, using the Eclipse Workbench, Java, XML, broadcast receivers, and the Android Market.",
	"publisher": "John Wiley \u0026 Sons",
	"publishedDate": "2011-12-13",
	"pageCount": 652,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=IuCZfE7r_w4C\u0026printsec=frontcover\u0026dq=isbn:1118027701\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=IuCZfE7r_w4C\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api",
	"authors": [{
		"id": 12,
		"name": "Barry Burd",
		"nationality": null
	}]
}, {
	"id": 11,
	"isbn": "9780113310593",
	"title": "Managing successful projects with PRINCE2",
	"subtitle": null,
	"description": "This book provides a universally applicable project management method - the principles, processes and techniques that enable individuals and organisations successfully to deliver their projects within time, cost and quality constraints. This new edition has been designed to place more emphasis on the principles that underpin successful project management and to provide clear guidance on how to apply these principles to the organisational context within which projects are operating.",
	"publisher": "The Stationery Office",
	"publishedDate": "2009-06-08",
	"pageCount": 327,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=9Oa2MFvhRlMC\u0026printsec=frontcover\u0026dq=isbn:9780113310593\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=9Oa2MFvhRlMC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api",
	"authors": [{
		"id": 13,
		"name": "Office of Government Commerce",
		"nationality": null
	}]
}, {
	"id": 12,
	"isbn": "9780321503626",
	"title": "Growing Object-oriented Software, Guided by Tests",
	"subtitle": null,
	"description": "Foreword by Kent Beck \"The authors of this book have led a revolution in the craft of programming by controlling the environment in which software grows.\" --Ward Cunningham \"At last, a book suffused with code that exposes the deep symbiosis between TDD and OOD. This one's a keeper.\" --Robert C. Martin \"If you want to be an expert in the state of the art in TDD, you need to understand the ideas in this book.\"--Michael Feathers Test-Driven Development (TDD) is now an established technique for delivering better software faster. TDD is based on a simple idea: Write tests for your code before you write the code itself. However, this \"simple\" idea takes skill and judgment to do well. Now there's a practical guide to TDD that takes you beyond the basic concepts. Drawing on a decade of experience building real-world systems, two TDD pioneers show how to let tests guide your development and \"grow\" software that is coherent, reliable, and maintainable. Steve Freeman and Nat Pryce describe the processes they use, the design principles they strive to achieve, and some of the tools that help them get the job done. Through an extended worked example, you'll learn how TDD works at multiple levels, using tests to drive the features and the object-oriented structure of the code, and using Mock Objects to discover and then describe relationships between objects. Along the way, the book systematically addresses challenges that development teams encounter with TDD--from integrating TDD into your processes to testing your most difficult features. Coverage includes * Implementing TDD effectively: getting started, and maintaining your momentum throughout the project * Creating cleaner, more expressive, more sustainable code * Using tests to stay relentlessly focused on sustaining quality * Understanding how TDD, Mock Objects, and Object-Oriented Design come together in the context of a real software development project * Using Mock Objects to guide object-oriented designs * Succeeding where TDD is difficult: managing complex test data, and testing persistence and concurrency",
	"publisher": "Addison-Wesley Professional",
	"publishedDate": "2010",
	"pageCount": 358,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=vkb7mAEACAAJ\u0026dq=isbn:9780321503626\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=vkb7mAEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 14,
		"name": "Steve Freeman",
		"nationality": null
	}, {
		"id": 15,
		"name": "Nat Pryce",
		"nationality": null
	}]
}, {
	"id": 13,
	"isbn": "9780131177055",
	"title": "Working Effectively with Legacy Code",
	"subtitle": null,
	"description": "Preface Do you remember the first program you wrote? I remember mine. It was a little graphics program I wrote on an early PC. I started programming later than most of my friends. Sure, I'd seen computers when I was a kid. I remember being really impressed by a minicomputer I once saw in an office, but for years I never had a chance to even sit at a computer. Later, when I was a teenager, some friends of mine bought a couple of the first TRS-80s. I was interested, but I was actually a bit apprehensive, too. I knew that if I started to play with computers, I'd get sucked into it. It just looked too cool. I don't know why I knew myself so well, but I held back. Later, in college, a roommate of mine had a computer, and I bought a C compiler so that I could teach myself programming. Then it began. I stayed up night after night trying things out, poring through the source code of the emacs editor that came with the compiler. It was addictive, it was challenging, and I loved it. I hope you've had experiences like thismdjust the raw joy of making things work on a computer. Nearly every programmer I ask has. That joy is part of what got us into this work, but where is it day to day? A few years ago, I gave my friend Erik Meade a call after I'd finished work one night. I knew that Erik had just started a consulting gig with a new team, so I asked him, \"How are they doing?\" He said, \"They're writing legacy code, man.\" That was one of the few times in my life when I was sucker-punched by a coworker's statement. I felt it right in my gut. Erik had given words to the precise feeling that I often get when I visit teams for the first time. They are trying very hard, but at the end of the day, because of schedule pressure, the weight of history, or a lack of any better code to compare their efforts to, many people are writing legacy code. What is legacy code? I've used the term without defining it. Let's look at the strict definition: Legacy code is code that we've gotten from someone else. Maybe our company acquired code from another company; maybe people on the original team moved on to other projects. Legacy code is somebody else's code. But in programmer-speak, the term means much more than that. The termlegacy codehas taken on more shades of meaning and more weight over time. What do you think about when you hear the termlegacy code? If you are at all like me, you think of tangled, unintelligible structure, code that you have to change but don't really understand. You think of sleepless nights trying to add in features that should be easy to add, and you think of demoralization, the sense that everyone on the team is so sick of a code base that it seems beyond care, the sort of code that you just wish would die. Part of you feels bad for even thinking about making it better. It seems unworthy of your efforts. That definition of legacy code has nothing to do with who wrote it. Code can degrade in many ways, and many of them have nothing to do with whether the code came from another team. In the industry,legacy codeis often used as a slang term for difficult-to-change code that we don't understand. But over years of working with teams, helping them get past serious code problems, I've arrived at a different definition. To me,legacy codeis simply code without tests. I've gotten some grief for this definition. What do tests have to do with whether code is bad? To me, the answer is straightforward, and it is a point that I elaborate throughout the book: Code without tests is bad code. It doesn't matter how well written it is; it doesn't matter how pretty or object-oriented or well-encapsulated it is. With tests, we can change the behavior of our code quickly and verifiably. Without them, we really don't know if our code is getting better or worse. You might think that this is severe. What about clean code? If a code base is very clean and well structured, isn't that enough? Well, make no mistake. I love clean code. I love it more than most people I know, but while clean code is good, it's not enough. Teams take serious chances when they try to make large changes without tests. It is like doing aerial gymnastics without a net. It requires incredible skill and a clear understanding of what can happen at every step. Knowing precisely what will happen if you change a couple of variables is often like knowing whether another gymnast is going to catch your arms after you come out of a somersault. If you are on a team with code that clear, you are in a better position than most programmers. In my work, I've noticed that teams with that degree of clarity in all of their code are rare. They seem like a statistical anomaly. And, you know what? If they don't have supporting tests, their code changes still appear to be slower than those of teams that do. Yes, teams do get better and start to write clearer code, but it takes a long time for older code to get clearer. In many cases, it will never happen completely. Because of this, I have no problem defining legacy code as code without tests. It is a good working definition, and it points to a solution. I've been talking about tests quite a bit so far, but this book is not about testing. This book is about being able to confidently make changes in any code base. In the following chapters, I describe techniques that you can use to understand code, get it under test, refactor it, and add features. One thing that you will notice as you read this book is that it is not a book about pretty code. The examples that I use in the book are fabricated because I work under nondisclosure agreements with clients. But in many of the examples, I've tried to preserve the spirit of code that I've seen in the field. I won't say that the examples are always representative. There certainly are oases of great code out there, but, frankly, there are also pieces of code that are far worse than anything I can use as an example in this book. Aside from client confidentiality, I simply couldn't put code like that in this book without boring you to tears and burying important points in a morass of detail. As a result, many of the examples are relatively brief. If you look at one of them and think \"No, he doesn't understandmdmy methods are much larger than that and much worse,\" please look at the advice that I am giving at face value and see if it applies, even if the example seems simpler. The techniques here have been tested on substantially large pieces of code. It is just a limitation of the book format that makes examples smaller. In particular, when you see ellipses (el) in a code fragment like this, you can read them as \"insert 500 lines of ugly code here\": m_pDispatcher-\u003eregister(listener);...m_nMargins++; If this book is not about pretty code, it is even less about pretty design. Good design should be a goal for all of us, but in legacy code, it is something that we arrive at in discrete steps. In some of the chapters, I describe ways of adding new code to existing code bases and show how to add it with good design principles in mind. You can start to grow areas of very good high-quality code in legacy code bases, but don't be surprised if some of the steps you take to make changes involve making some code slightly uglier. This work is like surgery. We have to make incisions, and we have to move through the guts and suspend some aesthetic judgment. Could this patient's major organs and viscera be better than they are? Yes. So do we just forget about his immediate problem, sew him up again, and tell him to eat right and train for a marathon? We could, but what we really need to do is take the patient as he is, fix what's wrong, and move him to a healthier state. He might never become an Olympic athlete, but we can't let \"best\" be the enemy of \"better.\" Code bases can become healthier and easier to work in. When a patient feels a little better, often that is the time when you can help him make commitments to a healthier life style. That is what we are shooting for with legacy code. We are trying to get to the point at which we are used to ease; we expect it and actively attempt to make code change easier. When we can sustain that sense on a team, design gets better. The techniques I describe are ones that I've discovered and learned with coworkers and clients over the course of years working with clients to try to establish control over unruly code bases. I got into this legacy code emphasis accidentally. When I first started working with Object Mentor, the bulk of my work involved helping teams with serious problems develop their skills and interactions to the point that they could regularly deliver quality code. We often used Extreme Programming practices to help teams take control of their work, collaborate intensively, and deliver. I often feel that Extreme Programming is less a way to develop software than it is a way to make a well-jelled work team that just happens to deliver great software every two weeks. From the beginning, though, there was a problem. Many of the first XP projects were \"greenfield\" projects. The clients I was seeing had significantly large code bases, and they were in trouble. They needed some way to get control of their work and start to deliver. Over time, I found that I was doing the same things over and over again with clients. This sense culminated in some work I was doing with a team in the financial industry. Before I'd arrived, they'd realized that unit testing was a great thing, but the tests that they were executing were full scenario tests that made multiple trips to a database and exercised large chunks of code. The tests were hard to write, and the team didn't run them very often because they took so long to run. As I sat down with them to break dependencies and get smaller chunks of code under test, I had a terrible sense of deasjaag vu. It seemed that I was doing this sort of work with every team I met, and it was the sort of thing that no one really wanted to think about. It was just the grunge work that you do when you want to start working with your code in a controlled way, if you know how to do it. I decided then that it was worth really reflecting on how we were solving these problems and writing them down so that teams could get a leg up and start to make their code bases easier to live in. A note about the examples: I've used examples in several different programming languages. The bulk of the examples are written in Java, C++, and C. I picked Java because it is a very common language, and I included C++ because it presents some special challenges in a legacy environment. I picked C because it highlights many of the problems that come up in procedural legacy code. Among them, these languages cover much of the spectrum of concerns that arise in legacy code. However, if the languages you using are not covered in the examples, take a look at them anyway. Many of the techniques that I cover can be used in other languages, such as Delphi, Visual Basic, COBOL, and FORTRAN. I hope that you find the techniques in this book helpful and that they allow you to get back to what is fun about programming. Programming can be very rewarding and enjoyable work. If you don't feel that in your day-to-day work, I hope that the techniques I offer you in this book help you find it and grow it on your team. Acknowledgements First of all, I owe a serious debt to my wife, Ann, and my children, Deborah and Ryan. Their love and support made this book and all of the learning that preceded it possible. I'd also like to thank \"Uncle Bob\" Martin, president and founder of Object Mentor. His rigorous pragmatic approach to development and design, separating the critical from the inconsequential, gave me something to latch upon about 10 years ago, back when it seemed that I was about to drown in a wave of unrealistic advice. And thanks, Bob, for giving me the opportunity to see more code and work with more people over the past five years than I ever imagined possible. I also have to thank Kent Beck, Ron Jeffries, and Ward Cunningham for offering me advice at times and teaching me a great deal about team work, design, and programming. Special thanks to all of the people who reviewed the drafts. The official reviewers were Sven Gorts, Robert C. Martin, Erik Meade, and Bill Wake; the unofficial reviewers were Dr. Robert Koss, James Grenning, Lowell Lindstrom, Micah Martin, Russ Rufer and the Silicon Valley Patterns Group, and James Newkirk. Thanks also to reviewers of the very early drafts I placed on the Internet. Their feedback significantly affected the direction of the book after I reorganized its format. I apologize in advance to any of you I may have left out. The early reviewers were: Darren Hobbs, Martin Lippert, Keith Nicholas, Phlip Plumlee, C. Keith Ray, Robert Blum, Bill Burris, William Caputo, Brian Marick, Steve Freeman, David Putman, Emily Bache, Dave Astels, Russel Hill, Christian Sepulveda, and Brian Christopher Robinson. Thanks also to Joshua Kerievsky who gave a key early review and Jeff Langr who helped with advice and spot reviews all through the process. The reviewers helped me polish the draft considerably, but if there are errors remaining, they are solely mine. Thanks to Martin Fowler, Ralph Johnson, Bill Opdyke, Don Roberts, and John Brant for their work in the area of refactoring. It has been inspirational. I also owe a special debt to Jay Packlick, Jacques Morel, and Kelly Mower of Sabre Holdings, and Graham Wright of Workshare Technology for their support and feedback. Special thanks also to Paul Petralia, Michelle Vincenti, Lori Lyons, Krista Hansing, and the rest of the team at Prentice-Hall. Thank you, Paul, for all of the help and encouragement that this first-time author needed. Special thanks also to Gary and Joan Feathers, April Roberts, Dr. Raimund Ege, David Lopez de Quintana, Carlos Perez, Carlos M. Rodriguez, and the late Dr. John C. Comfort for help and encouragement over the years.I also have to thank to Brian Button for the example in Chapter XX,I'm Changing the Same Code All Over the Place. He wrote that code in about an hour when we were developing a refactoring course together, and it's become my favorite piece of teaching code. Also, special thanks to Janik Top, whose instrumentalDe Futuraserved as the soundtrack for my last few weeks of work on this book. Finally, I'd like to thank everyone whom I've worked with over the past few years whose insights and challenges strengthened the material in this book. Michael Feathers mfeathers@objectmentor.com © Copyright Pearson Education. All rights reserved.",
	"publisher": "Prentice Hall",
	"publishedDate": "2004",
	"pageCount": 434,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=vlo_nWophSYC\u0026dq=isbn:9780131177055\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=vlo_nWophSYC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 16,
		"name": "Michael C. Feathers",
		"nationality": null
	}]
}, {
	"id": 14,
	"isbn": "0976694026",
	"title": "Manage It!",
	"subtitle": "Your Guide to Modern, Pragmatic Project Management",
	"description": "Provides advice for managing a software design project, covering such topics as planning and using life cycles, scheduling, creating a project team, managing meetings, integrating testing, and completing a project.",
	"publisher": null,
	"publishedDate": "2007",
	"pageCount": 351,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=253AmgEACAAJ\u0026dq=isbn:0976694026\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=253AmgEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 17,
		"name": "Johanna Rothman",
		"nationality": null
	}]
}, {
	"id": 15,
	"isbn": "9781593277574",
	"title": "Understanding ECMAScript 6",
	"subtitle": "The Definitive Guide for JavaScript Developers",
	"description": "ECMAScript 6 represents the biggest update to the core of JavaScript in the history of the language. In Understanding ECMAScript 6, expert developer Nicholas C. Zakas provides a complete guide to the object types, syntax, and other exciting changes that ECMAScript 6 brings to JavaScript. Every chapter is packed with example code that works in any JavaScript environment so you’ll be able to see new features in action. You’ll learn: *How ECMAScript 6 class syntax relates to more familiar JavaScript concepts *What makes iterators and generators useful *How arrow functions differ from regular functions *Ways to store data with sets, maps, and more *The power of inheritance *How to improve asynchronous programming with promises *How modules change the way you organize code Whether you’re a web developer or a Node.js developer, you’ll find Understanding ECMAScript 6 indispensable on your journey from ECMAScript 5 to ECMAScript 6.",
	"publisher": "No Starch Press",
	"publishedDate": "2016-12-16",
	"pageCount": 352,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=6Ze7DQAAQBAJ\u0026printsec=frontcover\u0026dq=isbn:9781593277574\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=6Ze7DQAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api",
	"authors": [{
		"id": 18,
		"name": "Nicholas C. Zakas",
		"nationality": null
	}]
}, {
	"id": 16,
	"isbn": "9780578012810",
	"title": "Getting Real",
	"subtitle": "The Smarter, Faster, Easier Way to Build a Successful Web Application",
	"description": "Getting Real details the business, design, programming, and marketing principles of 37signals. The book is packed with keep-it-simple insights, contrarian points of view, and unconventional approaches to software design. This is not a technical book or a design tutorial, it's a book of ideas. Anyone working on a web app - including entrepreneurs, designers, programmers, executives, or marketers - will find value and inspiration in this book. 37signals used the Getting Real process to launch five successful web-based applications (Basecamp, Campfire, Backpack, Writeboard, Ta-da List), and Ruby on Rails, an open-source web application framework, in just two years with no outside funding, no debt, and only 7 people (distributed across 7 time zones). Over 500,000 people around the world use these applications to get things done. Now you can find out how they did it and how you can do it too. It's not as hard as you think if you Get Real.",
	"publisher": null,
	"publishedDate": "2006",
	"pageCount": 187,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=NIZNQwAACAAJ\u0026dq=isbn:9780578012810\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=NIZNQwAACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 19,
		"name": "Jason Fried",
		"nationality": null
	}, {
		"id": 20,
		"name": "Heinemeier David Hansson",
		"nationality": null
	}, {
		"id": 21,
		"name": "Matthew Linderman",
		"nationality": null
	}]
}, {
	"id": 17,
	"isbn": "1119326036",
	"title": "Customer Obsessed",
	"subtitle": "A Whole Company Approach to Delivering Exceptional Customer Experiences",
	"description": "\"Whether or not you use Salesforce, this book will provide you with a strategic framework to drive business transformation for your organization and your customers, and give an understanding of how cloud technology influences, and is influenced by, current trends and developments in design, analytics, and customer and employee culture\"--",
	"publisher": "John Wiley \u0026 Sons",
	"publishedDate": "2016-10-03",
	"pageCount": 272,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=nfHzDAAAQBAJ\u0026printsec=frontcover\u0026dq=isbn:1119326036\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=nfHzDAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api",
	"authors": [{
		"id": 22,
		"name": "Eric Berridge",
		"nationality": null
	}]
}, {
	"id": 18,
	"isbn": "9780123735584",
	"title": "Measuring the User Experience",
	"subtitle": "Collecting, Analyzing, and Presenting Usability Metrics",
	"description": "An important aspect of usability is being able to measure how usable a system really is, and how changes to the user interface of the system impact the end-user experience. This aspect of usability is known as usability metrics. This work looks at how to collect, analyse and present usability metrics.",
	"publisher": "Morgan Kaufmann Pub",
	"publishedDate": "2008",
	"pageCount": 317,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=UrCvmAEACAAJ\u0026dq=isbn:9780123735584\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=UrCvmAEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 23,
		"name": "Thomas S. Tullis",
		"nationality": null
	}, {
		"id": 24,
		"name": "William Albert",
		"nationality": null
	}]
}, {
	"id": 19,
	"isbn": "1119167965",
	"title": "Customer Success",
	"subtitle": "How Innovative Companies Are Reducing Churn and Growing Recurring Revenue",
	"description": "\"Customer Success will become the authoritative book of the emerging Customer Success industry and target any business that is trying to focus, or re-focus, on customers and will be applicable to all customer management roles such as Account Manager, Customer Advocacy, Client Relationship Manager, and Customer Success Manager along with the leadership of those organizations. Customer Success will address the pains of how to start creating a customer-centric company and how to think strategically about Customer Success - how to organize, compensate, find a leader, measure, etc. Customer Success has exploded as one of the hottest B2B movements since the advent of the subscription business model\"--",
	"publisher": "John Wiley \u0026 Sons",
	"publishedDate": "2016-02-29",
	"pageCount": 256,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=u01ICgAAQBAJ\u0026printsec=frontcover\u0026dq=isbn:1119167965\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=u01ICgAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api",
	"authors": [{
		"id": 25,
		"name": "Nick Mehta",
		"nationality": null
	}, {
		"id": 26,
		"name": "Dan Steinman",
		"nationality": null
	}, {
		"id": 27,
		"name": "Lincoln Murphy",
		"nationality": null
	}]
}, {
	"id": 20,
	"isbn": "9780692620939",
	"title": "Farm Don't Hunt",
	"subtitle": "The Definitive Guide to Customer Success",
	"description": null,
	"publisher": null,
	"publishedDate": "2016-02-25",
	"pageCount": null,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=tphOjwEACAAJ\u0026dq=isbn:9780692620939\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=tphOjwEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 28,
		"name": "Guy Nirpaz",
		"nationality": null
	}, {
		"id": 29,
		"name": "Fernando Pizarro",
		"nationality": null
	}]
}, {
	"id": 21,
	"isbn": "0273775081",
	"title": "The Ten Principles Behind Great Customer Experiences",
	"subtitle": null,
	"description": "Create a great customer experience whoever you are. Customers are powerful. They have a loud voice, a wealth of choice and their expectations are higher than ever. This book covers ten principles you can use to make real worldimprovements to your customers experiences, whatever your businessdoes and whoever you are. For managers, leaders and those starting a new business, the book shows that making improvements customers will appreciate doesn t need to be complicated or cost a fortune. Written for results Practical advice that s easy to implement Start making improvements fast Everything you need Get started immediately using the companion worksheets No jargon Effortless to read No previous knowledge required Inspiring examples Key ideas are brought to life by great case studies Universally applicable The principles work for any product or service, however large the business Concise and skimmable Read a chapter a day on your commute Get what you need, whatever your time limits \"",
	"publisher": "Ft Press",
	"publishedDate": "2013",
	"pageCount": 240,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=fmlvMAEACAAJ\u0026dq=isbn:0273775081\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=fmlvMAEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 30,
		"name": "Matt Watkinson",
		"nationality": null
	}]
}, {
	"id": 22,
	"isbn": "145550890X",
	"title": "Delivering Happiness",
	"subtitle": "A Path to Profits, Passion and Purpose",
	"description": "·Pay brand-new employees $2,000 to quit ·Make customer service the responsibility of the entire company-not just a department ·Focus on company culture as the no.1 priority ·Apply research from the science of happiness to running a business ·Help employees grow-both personally and professionally ·Seek to change the world ·Oh, and make money too . . . Sound crazy? It's all standard operating procedure at Zappos, the online retailer that's doing over $1 billion in gross merchandise sales annually. After debuting as the highest-ranking newcomer in Fortune magazine's annual \"Best Companies to Work For\" list in 2009, Zappos was acquired by Amazon in a deal valued at over $1.2 billion on the day of closing. In DELIVERING HAPPINESS, Zappos CEO Tony Hsieh shares the different lessons he has learned in business and life, from starting a worm farm to running a pizza business, through LinkExchange, Zappos, and more. Fast-paced and down-to-earth, DELIVERING HAPPINESS shows how a very different kind of corporate culture is a powerful model for achieving success-and how by concentrating on the happiness of those around you, you can dramatically increase your own.",
	"publisher": null,
	"publishedDate": "2011-10",
	"pageCount": 289,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=B7xhpwAACAAJ\u0026dq=isbn:145550890X\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=B7xhpwAACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 31,
		"name": "Tony Hsieh",
		"nationality": null
	}]
}, {
	"id": 23,
	"isbn": "0349403406",
	"title": "The Book of Leadership",
	"subtitle": "How to Get Yourself, Your Team and Your Company Further Than You Ever Thought Possible",
	"description": "Have you ever wondered what characteristics are shared by successful business leaders? Have you ever asked yourself what it is that they do differently which makes them and their organisations stand out from the crowd? And what can you learn from them to ensure your own success? If so, The Book of Leadership is for you. Over the last six years, Anthony Gell has conducted interviews with some of the most successful CEOs, entrepreneurs and business thinkers in the world, including Sir Terry Leahy, former CEO of Tesco, Richard Reed, founder of innocent drinks, Olaf Swantee, CEO of EE and Daniel Goleman, author of the bestselling Emotional Intelligence. Now for the first time, he is bringing together hours of exclusive interview footage into a single resource for anybody looking to improve their leadership skills. In The Book of Leadership he combines his own experiences as a CEO with those of the leaders he has interviewed to provide insights and advice in three core areas: * Part 1 looks at leaders as individuals and reveals the personal habits and attributes that have laid the foundations for their success. * Part 2 focuses on what it takes to build and motivate a world class team * Part 3 goes beyond team leadership to identify how the habits of effective leadership are carried through on a larger scale in organisations.",
	"publisher": "Piatkus Books",
	"publishedDate": "2014-11-01",
	"pageCount": 368,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=Z4NHngEACAAJ\u0026dq=isbn:0349403406\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=Z4NHngEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 32,
		"name": "Anthony Gell",
		"nationality": null
	}]
}, {
	"id": 24,
	"isbn": "1626344035",
	"title": "Lovability",
	"subtitle": null,
	"description": "Love is the surprising emotion that companies cannot afford to ignore. ​Lovability -- genuine, heartfelt devotion and loyalty from customers -- is what propels a select few companies ahead, leading to consistent growth and profitability. Think about the companies that you really care about and how they make you feel. Love is central to all human interactions, and business is made up of human interactions. Do the math and the solution is clear: Love is central to business. Nobody talks about it, but it is obvious in hindsight that love is everything in all we work for and can even be measured. Lovability: How to Build a Business That People Love and Be Happy Doing It​ shares what Silicon Valley-based author and Aha! CEO Brian de Haaff knows from a career of founding successful technology companies and building award-winning products. He reveals the secret to the phenomenal growth of Aha! and the engine behind customer love -- a set of principles that he pioneered and named The Responsive Method. In preparation for writing this book, he interviewed well-known entrepreneurs, executives, and CEOs at hundreds of name brand and agile organizations to help readers discover how to build their own lovable products and be happy doing it. Much has been written about how to build a breakthrough product and a successful business, but the author's message is original and refreshing. He suggests that most of what you have learned should be rethought. In a business world that has increasingly emphasized hype over substance and get-big-at-any-cost over profitable and sustainable growth, it's time for a new recipe for company success. Lovability is the essential ingredient that you have been looking for.",
	"publisher": "Greenleaf Book Group Press",
	"publishedDate": "2017-04-25",
	"pageCount": null,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=jiY6vgAACAAJ\u0026dq=isbn:1626344035\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=jiY6vgAACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 33,
		"name": "Brian De Haaff",
		"nationality": null
	}]
}, {
	"id": 25,
	"isbn": "9780131111554",
	"title": "Agile and Iterative Development",
	"subtitle": "A Manager's Guide",
	"description": "• •The latest teachings from noted software development expert Craig Larman •Provides managers and practitioners alike with a summary of the key ideas of agile development, and evidence for its value •Details the four most important iterative methods: Extreme Programming, Scrum, the Rational Unified Process, and Evo",
	"publisher": "Addison-Wesley Professional",
	"publishedDate": "2004",
	"pageCount": 342,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=76rnV5Exs50C\u0026printsec=frontcover\u0026dq=isbn:9780131111554\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=76rnV5Exs50C\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api",
	"authors": [{
		"id": 34,
		"name": "Craig Larman",
		"nationality": null
	}]
}, {
	"id": 26,
	"isbn": "1119114098",
	"title": "Influencer Marketing For Dummies",
	"subtitle": null,
	"description": "Are you a marketing guru looking to stay at the top of your game? Then you need to be in the know on influencer marketing. A hybrid of content marketing and native advertising, influencer marketing is an established trend in marketing that identifies and targets individuals with influence over potential buyers. Although this has usually meant focusing on popular celebrities and Internet personalities, there is a new wave of 'everyday consumers' that can have a large impact. In Influencer Marketing For Dummies, you'll find out how to market to those who rock social media--and, subsequently, grow your brand.",
	"publisher": "John Wiley \u0026 Sons",
	"publishedDate": "2015-12-14",
	"pageCount": 312,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=Wh6JCgAAQBAJ\u0026printsec=frontcover\u0026dq=isbn:1119114098\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=Wh6JCgAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api",
	"authors": [{
		"id": 35,
		"name": "Kristy Sammis",
		"nationality": null
	}, {
		"id": 36,
		"name": "Cat Lincoln",
		"nationality": null
	}, {
		"id": 37,
		"name": "Stefania Pomponi",
		"nationality": null
	}]
}, {
	"id": 27,
	"isbn": "9781473613805",
	"title": "Black Box Thinking",
	"subtitle": "The Surprising Truth About Success",
	"description": "What links the Mercedes Formula One team with Google? What links Dave Braisford's Team Sky and the aviation industry? What is the connection between the inventor James Dyson and the footballer David Beckham? They are all Black Box Thinkers. Whether developing a new product, honing a core skill or just trying to get a critical decision right, Black Box Thinkers aren't afraid to face up to mistakes. In fact, they see failure as the very best way to learn. Rather than denying their mistakes, blaming others or attempting to spin their way out of trouble, these institutions and individuals interrogate errors as part of their future strategy for success. How many of us, hand on heart, can say that we have such a healthy relationship with failure? Learning from failure has the status of a cliché, but this book reveals the astonishing story behind the most powerful method of learning known to mankind, and reveals the arsenal of techniques wielded by some of the world's most innovative organizations. Their lessons can be applied across every field - from sport to education, from business to health. Using gripping case studies, exclusive interviews and really practical takeaways, Matthew Syed - the award-winning journalist and best-selling author of Bounce - explains how to turn failure into success, and shows us how we can all become better Black Box Thinkers.",
	"publisher": "John Murray",
	"publishedDate": "2016-04-07",
	"pageCount": 352,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=YLIYjgEACAAJ\u0026dq=isbn:9781473613805\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=YLIYjgEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 38,
		"name": "Matthew Syed",
		"nationality": null
	}]
}, {
	"id": 28,
	"isbn": "0345528433",
	"title": "Blindspot",
	"subtitle": "Hidden Biases of Good People",
	"description": "A pair of leading psychologists argues that prejudice toward others is often an unconscious part of the human psyche, providing an analysis of the science behind biased feelings while sharing guidelines for identifying and learning from hidden prejudices. 15,000 first printing.",
	"publisher": "Bantam",
	"publishedDate": "2016-08-16",
	"pageCount": 272,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=z6WvDAAAQBAJ\u0026dq=isbn:0345528433\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=z6WvDAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 39,
		"name": "Mahzarin R. Banaji",
		"nationality": null
	}, {
		"id": 40,
		"name": "Anthony G. Greenwald",
		"nationality": null
	}]
}, {
	"id": 29,
	"isbn": "9780470485842",
	"title": "The Loudest Duck",
	"subtitle": "Moving Beyond Diversity While Embracing Differences to Achieve Success at Work",
	"description": "A business fable that explains why organizations need to move beyond the old-style diversity efforts to actually benefit from difference In today's modern workplaces with their many different types of people, cultural and personal differences can be challenges-whether you're a team-member or a business leader. Different cultures teach different values and we carry those values throughout adulthood and into the office environment. Understanding the cultural and gender viewpoints of our colleagues is a major key to healthy, conflict-free work environments. This fable takes its name from a Chinese children's parable about how \"the loudest duck gets shot.\" It's a parable that contrasts with the American idiom \"the squeaky wheel gets the grease.\" Comparing the two, it's clear that different cultures teach different views, and those views often translate into distinct ways of doing business. In today's global business world, understanding each other-where we come from and what we're taught-is more important than ever. A business fable that points out how the old way of approaching diversity will never work, showing us how to understand and navigate the cultural and gender differences that cause conflict in the office Perfect for managers and executives faced with leadership challenges in a heterogeneous workforce and who want to make sure their organization is a true meritocracy and a level playing field for everyone Ideal for anyone, at any level, who wants more tools in their toolbox to get ahead in business in a global business culture Doing business today takes understanding and cultural intelligence. The Loudest Duck uses an entertaining story to share important lessons about why diversity efforts are bound to fail unless we really understand how we unconsciously respond to difference and how to move to beyond it. Praise for The Loudest Duck “Laura Liswood has both great theoretical and practical understanding of diversity—why it is important in organizations and why attempts to create it often fail to deliver. The Loudest Duck is essential reading for anyone who wants to maximize the effectiveness of organizations or just wants to understand why things are the way they are.” —Rt. Hon. Kim Campbell Canada's 19th and first female Prime Minister “Diversity is a popular buzzword, but too many organizations treat it as window dressing. Laura Liswood explains how successful leaders learn to value diversity for the advantages it brings. This book is clearly written, savvy, and wise.” —Joseph S. Nye Jr. University Distinguished Service Professor at Harvard University; Author of The Powers to Lead “The Loudest Duck is a must read for managers and leaders of multinational corporations and international organizations. It provides an insightful look and fresh approach to cultural and gender differences that must be better understood for a more effective workplace.” —Ann M. Veneman Executive Director, UNICEF “Laura Liswood brilliantly shows us how to get to Diversity 2.0 and beyond. A workplace of people from different backgrounds can lead to tensions, but this book shows, with great insights and examples, how it can lead to real creativity instead. It's an indispensable guide for managers and leaders—and also for anyone who wants to succeed in any aspect of life.” —Walter Isaacson President and Chief Executive Officer, The Aspen Institute “Laura's timing is perfect and her message is spot on. Embracing diversity creates competitive advantage. Her book should be mandatory reading for everyone in business today. In the most engaging, fun, and real way, Laura gets to the heart of the opportunity—enabling Noah's diverse floating Ark to fly to the moon and beyond.” —Beth Brooke Global Vice Chair of Public Policy, Sustainability and Stakeholder Engagement, Ernst \u0026 Young “Globalized businesses are increasingly aware that diversity belongs in t",
	"publisher": "John Wiley \u0026 Sons",
	"publishedDate": "2010",
	"pageCount": 164,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=8Let_YwOoEMC\u0026dq=isbn:9780470485842\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=8Let_YwOoEMC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 41,
		"name": "Laura A. Liswood",
		"nationality": null
	}]
}, {
	"id": 30,
	"isbn": "0470521163",
	"title": "Behind the Cloud",
	"subtitle": "The Untold Story of How Salesforce.com Went from Idea to Billion-Dollar Company-and Revolutionized an Industry",
	"description": "How did salesforce.com grow from a start up in a rented apartment into the world's fastest growing software company in less than a decade? For the first time, Marc Benioff, the visionary founder, chairman and CEO of salesforce.com, tells how he and his team created and used new business, technology, and philanthropic models tailored to this time of extraordinary change. Showing how salesforce.com not only survived the dotcom implosion of 2001, but went on to define itself as the leader of the cloud computing revolution and spark a $46-billion dollar industry, Benioff's story will help business leaders and entrepreneurs stand out, innovate better, and grow faster in any economic climate. In Behind the Cloud, Benioff shares the strategies that have inspired employees, turned customers into evangelists, leveraged an ecosystem of partners, and allowed innovation to flourish.",
	"publisher": "Jossey-Bass",
	"publishedDate": "2009-10-19",
	"pageCount": 304,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=fLScDAEACAAJ\u0026dq=isbn:0470521163\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=fLScDAEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 42,
		"name": "Marc Benioff",
		"nationality": null
	}, {
		"id": 43,
		"name": "Carlye Adler",
		"nationality": null
	}]
}, {
	"id": 31,
	"isbn": "1444792385",
	"title": "Work Rules!",
	"subtitle": "Insights from Inside Google That Will Transform How You Live and Lead",
	"description": "Google receives over 1,500,000 unique applications for jobs every year. This book shows you why. * How to learn from your best employees - and your worst * Why you should only hire people who are smarter than you are * Take away managers' powers over employees * And why not to trust your gut instinct 'We spend more time working than doing anything else in life. It's not right that the experience should be so demotivating and dehumanizing.' So says Laszlo Bock, visionary head of People Operations at the company that transformed how the world interacts with knowledge: this insight is the heart of his brilliant first book. A compelling manifesto with the potential to change how we work and live, Work Rules! offers both a new philosophy of the new world of work and a blueprint for attracting the most spectacular talent and ensuring the brightest and best prosper. Your workplace and how you treat your employees has a huge effect on your success. In twelve vivid chapters, Bock lays out a series of surprising lessons from a range of industries - from household names to little-known innovators. He also takes us inside one of history's most explosively successful businesses to reveal why Google is consistently rated one of the best places to work in the world. His years of experience are distilled into a series of entertaining principles that are easy to put into action, whether you're a team of one or a team of thousands. Work Rules! shows how to strike a balance between creativity and structure, leading to success you can measure in quality of life as well as market share. Read it to build a better company from within rather than from above; read it to reawaken your joy in what you do. The way we work is changing - are you?",
	"publisher": "John Murray",
	"publishedDate": "2016-03-10",
	"pageCount": 416,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=f84ejgEACAAJ\u0026dq=isbn:1444792385\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=f84ejgEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 44,
		"name": "Laszlo Bock",
		"nationality": null
	}]
}, {
	"id": 32,
	"isbn": "1786491370",
	"title": "Disrupted",
	"subtitle": "Ludicrous Misadventures Into the Tech Start-Up Bubble",
	"description": null,
	"publisher": null,
	"publishedDate": "2016-09-01",
	"pageCount": 272,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=yycUDAEACAAJ\u0026dq=isbn:1786491370\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=yycUDAEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 45,
		"name": "Dan Lyons",
		"nationality": null
	}]
}, {
	"id": 33,
	"isbn": "0670921602",
	"title": "The Lean Startup",
	"subtitle": "How Today's Entrepreneurs Use Continuous Innovation to Create Radically Successful Businesses",
	"description": "\"Most startups are built to fail. But those failures, according to entrepreneur Eric Ries, are preventable. Startups don't fail because of bad execution, or missed deadlines, or blown budgets. They fail because they are building something nobody wants. Whether they arise from someone's garage or are created within a mature Fortune 500 organization, new ventures, by definition, are designed to create new products or services under conditions of extreme uncertainly. Their primary mission is to find out what customers ultimately will buy. One of the central premises of The Lean Startup movement is what Ries calls \"validated learning\" about the customer. It is a way of getting continuous feedback from customers so that the company can shift directions or alter its plans inch by inch, minute by minute. Rather than creating an elaborate business plan and a product-centric approach, Lean Startup prizes testing your vision continuously with your customers and making constant adjustments\"--",
	"publisher": null,
	"publishedDate": "2011",
	"pageCount": 320,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=BBhmAQAACAAJ\u0026dq=isbn:0670921602\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=BBhmAQAACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 46,
		"name": "Eric Ries",
		"nationality": null
	}]
}, {
	"id": 34,
	"isbn": "9780060516406",
	"title": "Built to Last",
	"subtitle": "Successful Habits of Visionary Companies",
	"description": "Drawing upon a six-year research project at the Stanford University Graduate School of Business, James C. Collins and Jerry I. Porras took eighteen truly exceptional and long-lasting companies and studied each in direct comparison to one of its top competitors. They examined the companies from their very beginnings to the present day -- as start-ups, as midsize companies, and as large corporations. Throughout, the authors asked: \"What makes the truly exceptional companies different from the comparison companies and what were the common practices these enduringly great companies followed throughout their history?\" Filled with hundreds of specific examples and organized into a coherent framework of practical concepts that can be applied by managers and entrepreneurs at all levels, Built to Last provides a master blueprint for building organizations that will prosper long into the 21st century and beyond.",
	"publisher": "Harper Collins",
	"publishedDate": "2002-08-20",
	"pageCount": 368,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=4jPgNqfnIXcC\u0026dq=isbn:9780060516406\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=4jPgNqfnIXcC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 47,
		"name": "Jim Collins",
		"nationality": null
	}, {
		"id": 48,
		"name": "Jerry I. Porras",
		"nationality": null
	}]
}, {
	"id": 35,
	"isbn": "0141182679",
	"title": "On the Road",
	"subtitle": null,
	"description": "Five decades after it was first published, Jack Kerouac's seminal Beat novel On the Road finally finds its way to the big screen, in a production from award-winning director Walter Salles (Motorcycle Diaries) starring Sam Riley (Control, Brighton Rock), Garret Hedlund (Friday Night Lights), Kristen Stewart (Twilight), Kirsten Dunst, Amy Adams and Viggo Mortensen.Sal Paradise (Sam Riley), a young innocent, joins his hero Dean Moriarty (Garrett Hedlund), a traveller and mystic, the living epitome of Beat, on a breathless, exuberant ride back and forth across the United States. Their hedonistic search for release or fulfilment through drink, sex, drugs and jazz becomes an exploration of personal freedom, a test of the limits of the American dream. A brilliant blend of fiction and autobiography, Jack Kerouac's exhilarating novel swings to the rhythms of 1950s underground America, racing towards the sunset with unforgettable exuberance, poignancy and autobiographical passion. One of the most influential and important novels of the 20th century, On the Road is the book that launched the Beat Generation and remains the bible of that literary movement.'The most beautifully executed, the clearest and the most important utterance yet made by the generation Kerouac himself named years ago as \"beat\"' The New York Times'Pop writing at its best. It changed the way I saw the world, making me yearn for fresh experience'Hanif Kureishi, Independent on Sunday'On the Road sold a trillion Levis and a million espresso machines, and also sent countless kids on the road'William Burroughs",
	"publisher": "Penguin UK",
	"publishedDate": "2000-01-01",
	"pageCount": 280,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=DXrPTHXZ4FwC\u0026printsec=frontcover\u0026dq=isbn:0141182679\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=DXrPTHXZ4FwC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api",
	"authors": [{
		"id": 49,
		"name": "Jack Kerouac",
		"nationality": null
	}, {
		"id": 50,
		"name": "Ann Charters",
		"nationality": null
	}]
}, {
	"id": 36,
	"isbn": "9781846558337",
	"title": "Colorless Tsukuru Tazaki and His Years of Pilgrimage",
	"subtitle": null,
	"description": "A mesmerising mystery story about friendship from the internationally bestselling author of Norwegian Wood and 1Q84 Tsukuru Tazaki had four best friends at school. By chance all of their names contained a colour. The two boys were called Akamatsu, meaning 'red pine', and Oumi, 'blue sea', while the girls' names were Shirane, 'white root', and Kurono, 'black field'. Tazaki was the only last name with no colour in it. One day Tsukuru Tazaki's friends announced that they didn't want to see him, or talk to him, ever again. Since that day Tsukuru has been floating through life, unable to form intimate connections with anyone. But then he meets Sara, who tells him that the time has come to find out what happened all those years ago.",
	"publisher": "Random House",
	"publishedDate": "2014-08-12",
	"pageCount": 298,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=GSEwBQAAQBAJ\u0026printsec=frontcover\u0026dq=isbn:9781846558337\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=GSEwBQAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api",
	"authors": [{
		"id": 51,
		"name": "Haruki Murakami",
		"nationality": null
	}]
}, {
	"id": 37,
	"isbn": "9780349411903",
	"title": "Deep Work",
	"subtitle": null,
	"description": "Many modern knowledge workers now spend most of their brain power battling distraction and interruption, whether because of the incessant pinging of devices, noisy open-plan offices or the difficulty of deciding what deserves your attention the most. When Cal Newport coined the term 'deep work' on his popular blog, Study Hacks, in 2012, he found the concept quickly hit a nerve. Most of us, after all, are excruciatingly familiar with shallow work instead - distractedly skimming the surface of our workload and never getting to the important part. Newport began exploring the methods and mindset that foster a practice of distraction-free productivity at work, and now, in DEEP WORK, he shows how anyone can achieve this elusive state. Through revealing portraits of both historical and modern-day thinkers, academics and leaders in the fields of technology, science and culture, and their deep work habits, Newport shares an inspiring collection of tools to wring every last drop of value out of your intellectual capacity. He explains why mastering this shift in work practices is crucial for anyone who intends to stay ahead in a complex information economy, and how to systematically train the mind to focus. Put simply: developing and cultivating a deep work practice is one of the best decisions we can make in an increasingly distracted world.",
	"publisher": "Piatkus Books",
	"publishedDate": "2016-01-05",
	"pageCount": 304,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=kjT_sgEACAAJ\u0026dq=isbn:9780349411903\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=kjT_sgEACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 52,
		"name": "Cal Newport",
		"nationality": null
	}]
}, {
	"id": 38,
	"isbn": "9780091929787",
	"title": "ReWork",
	"subtitle": "Change the Way You Work Forever",
	"description": "\"Jason Fried and David Heinemeier Hansson, co-founders of software company 37signals, follow a simpler-is-better philosophy. This extends from writing software used in microblogging phenomenon Twitter - to building a business and managing a career. he company has a million users and a payroll of eight. Their point of difference is pared down simplicity: they make products that are shockingly easy to use. The advice contained in ReWork aimed at small businesses is equally no-nonsense and inspired: spend less money, hire fewer people, work fewer hours, have fewer meetings, and perhaps most surprisingly offer fewer features. Essentially do less than the competition. hey focus on what really matters. Employees are fresh, energised and forced to avoid distractions. With short, to-the-point chapters, ReWork draws together what 37signals has learned in the trenches while building a hugely successful company that not only has loyal customers, it has raving fans. Inspirational, motivational and simple, ReWork will be the post-recession business book of the year.\"",
	"publisher": "Random House",
	"publishedDate": "2010",
	"pageCount": 279,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=ClszWsFKluoC\u0026printsec=frontcover\u0026dq=isbn:9780091929787\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=ClszWsFKluoC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api",
	"authors": [{
		"id": 53,
		"name": "Jason Fried",
		"nationality": null
	}, {
		"id": 54,
		"name": "David Heinemeier Hansson",
		"nationality": null
	}]
}, {
	"id": 39,
	"isbn": "9780141033570",
	"title": "Thinking, Fast and Slow",
	"subtitle": null,
	"description": "The New York Times Bestseller, acclaimed by author such as Freakonomics co-author Steven D. Levitt, Black Swan author Nassim Nicholas Taleb and Nudge co-author Richard Thaler, Thinking Fast and Slow offers a whole new look at the way our minds work, and how we make decisions.Why is there more chance we'll believe something if it's in a bold type face? Why are judges more likely to deny parole before lunch? Why do we assume a good-looking person will be more competent? The answer lies in the two ways we make choices: fast, intuitive thinking, and slow, rational thinking. This book reveals how our minds are tripped up by error and prejudice (even when we think we are being logical), and gives you practical techniques for slower, smarter thinking. It will enable to you make better decisions at work, at home, and in everything you do.",
	"publisher": "Penguin UK",
	"publishedDate": "2012",
	"pageCount": 499,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=AV9x8XakdV0C\u0026printsec=frontcover\u0026dq=isbn:9780141033570\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=AV9x8XakdV0C\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api",
	"authors": [{
		"id": 55,
		"name": "Daniel Kahneman",
		"nationality": null
	}]
}, {
	"id": 40,
	"isbn": "9781846683145",
	"title": "The Checklist Manifesto",
	"subtitle": "How to Get Things Right",
	"description": "One of the top ten greatest doctors in the world looks at the lowly checklist, and how this simple idea - which is free to reproduce - will revolutionise the way we approach problems, and help save lives.",
	"publisher": "Profile Books",
	"publishedDate": "2010",
	"pageCount": 209,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=_irukvjx8kkC\u0026dq=isbn:9781846683145\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=_irukvjx8kkC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 56,
		"name": "Atul Gawande",
		"nationality": null
	}]
}, {
	"id": 41,
	"isbn": "9780991260911",
	"title": "Happy Hour is 9 to 5",
	"subtitle": "How to Love Your Job, Love Your Life, and Kick Butt at Work",
	"description": "\"This book is for anyone who wants to enjoy work more--whether you are an employee or a manager, a new hire or a grizzled veteran, work in a small start-up, a huge corporation or the public sector. This book will give you the theory of happiness at work, simple, effective tools that you can use to create a better work life for yourself and a happier workplace, a massive dose of energy to get you to do something about it right here and now, [and] a specific plan to help you change your job for the better, find a new job where you can shine or to make your employees happy, motivated top-performers.\"--P. [4] of cover.",
	"publisher": "Pine Tribe",
	"publishedDate": "2014-01-01",
	"pageCount": 180,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=ot8IuAAACAAJ\u0026dq=isbn:9780991260911\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=ot8IuAAACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 57,
		"name": "Alexander Kjerulf",
		"nationality": null
	}]
}, {
	"id": 42,
	"isbn": "9781847946249",
	"title": "The Power of Habit",
	"subtitle": "Why We Do what We Do and how to Change",
	"description": "In The Power of Habit, award-winning New York Times business reporter Charles Duhigg takes us to the thrilling edge of scientific discoveries that explain why habits exist and how they can be changed. With penetrating intelligence and an ability to distill vast amounts of information into engrossing narratives, Duhigg brings to life a whole new understanding of human nature and its potential for transformation. Along the way we learn why some people and companies struggle to change, despite years of trying, while others seem to remake themselves overnight. We visit laboratories where neuroscientists explore how habits work and where, exactly, they reside in our brains. We discover how the right habits were crucial to the success of Olympic swimmer Michael Phelps, Starbucks CEO Howard Schultz, and civil-rights hero Martin Luther King, Jr. We go inside Procter \u0026 Gamble, Target superstores, Rick Warren's Saddleback Church, NFL locker rooms, and the nation's largest hospitals and see how implementing so-called keystone habits can earn billions and mean the difference between failure and success, life and death. At its core, The Power of Habit contains an exhilarating argument: The key to exercising regularly, losing weight, raising exceptional children, becoming more productive, building revolutionary companies and social movements, and achieving success is understanding how habits work. Habits aren't destiny. As Charles Duhigg shows, by harnessing this new science, we can transform our businesses, our communities, and our lives.",
	"publisher": "Random House",
	"publishedDate": "2013",
	"pageCount": 371,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=3IWKOZM-8isC\u0026printsec=frontcover\u0026dq=isbn:9781847946249\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=3IWKOZM-8isC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api",
	"authors": [{
		"id": 58,
		"name": "Charles Duhigg",
		"nationality": null
	}]
}, {
	"id": 43,
	"isbn": "0099448777",
	"title": "A Wild Sheep Chase",
	"subtitle": null,
	"description": "His life was like his recurring nightmare: a train to nowhere. But an ordinary life has a way of taking an extraordinary turn. Add a girl whose ears are so exquisite that, when uncovered, they improve sex a thousand-fold, a runaway friend, a right-wing politico, an ovine-obsessed professor and a manic-depressive in a sheep outfit, implicate them in a hunt for a sheep, that may or may not be running the world, and the upshot is another singular masterpiece from Japan's finest novelist. ** Murakamiâe(tm)s new novel is coming ** COLORLESS TSUKURU TAZAKI AND HIS YEARS OF PILGRIMAGE 'The reason why death had such a hold on Tsukuru Tazaki was clear. One day his four closest friends, the friends heâe(tm)d known for a long time, announced that they did not want to see him, or talk with him, ever again.'",
	"publisher": "Random House",
	"publishedDate": "2003",
	"pageCount": 299,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=PZiUy2lSgU0C\u0026printsec=frontcover\u0026dq=isbn:0099448777\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=PZiUy2lSgU0C\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api",
	"authors": [{
		"id": 59,
		"name": "Haruki Murakami",
		"nationality": null
	}]
}, {
	"id": 44,
	"isbn": "0718159039",
	"title": "Hate Mail",
	"subtitle": null,
	"description": "For fans of The Bunny Suicides, Simon's Catand 101 Uses of a Dead Catcomes the hilariously offensive Hate Mailby Mr Bingo. Mr Bingo loves post. In April 2011 he launched a service on his website, where, for a small payment, he would send his customer a vintage postcard with one of his iconic drawings and an offensive message on the back. So the purchaser gets a much sought-after original signed drawing, the postman gets a laugh and the world gets a little bit happier. Six days after launch, it had become so popular that he had to temporarily close the service. But fear not! Mr Bingo is teaming up with Penguin to create Hate Mail, a book that will showcase 100 of his favourite comic cards. Mr Bingo didn't learn a lot at school but he did discover one valuable thing: he was good at making people laugh. Now an enormously successful illustrator based in Shoreditch, he is 'drawing stuff' for the likes of The Mighty Boosh, QI, the Guardian, MTVand The New York Times. As well as making pictures, Mr Bingo regularly speaks at events on his favourite topics, such as religion, the internet, dating, animals, art and terrorism. 'Gorgeous and funny! Like a labrador doing stand-up.' Noel Fielding",
	"publisher": null,
	"publishedDate": "2012",
	"pageCount": 100,
	"language": "en",
	"google_preview_link": "http://books.google.co.uk/books?id=4eWsuAAACAAJ\u0026dq=isbn:0718159039\u0026hl=\u0026cd=1\u0026source=gbs_api",
	"google_thumbnail": "http://books.google.com/books/content?id=4eWsuAAACAAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026source=gbs_api",
	"authors": [{
		"id": 60,
		"name": "Bingo",
		"nationality": null
	}]
}]
